In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("E:\\codebasic\\working\\population_projection.csv")

In [3]:
df

,year,month,state,gender,value,unit,note
0,2036,October,West Bengal,Total,43964,value in Thousands,NaN
1,2036,October,West Bengal,Male,22615,value in Thousands,NaN
2,2036,October,West Bengal,Female,21349,value in Thousands,NaN
3,2036,October,Uttarakhand,Total,5506,value in Thousands,NaN
4,2036,October,Uttarakhand,Male,2922,value in Thousands,NaN
...,...,...,...,...,...,...,...
8887,2011,July,Andaman and Nicobar Islands,Male,77,value in Thousands,NaN
8888,2011,July,Andaman and Nicobar Islands,Female,67,value in Thousands,NaN
8889,2011,July,All India,Total,380145,value in Thousands,NaN
8890,2011,July,All India,Male,197066,value in Thousands,NaN
8891,2011,July,All India,Female,183079,value in Thousands,NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8892 entries, 0 to 8891
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    8892 non-null   int64
 1   month   8892 non-null   object
 2   state   8892 non-null   object
 3   gender  8892 non-null   object
 4   value   8892 non-null   int64
 5   unit    8892 non-null   object
 6   note    0 non-null      float64
dtypes: float64(1), int64(2), object(4)
memory usage: 486.4+ KB

In [5]:
#lets remove note column axis=1 cause we are operating on column 
df= df.drop(['note'], axis = 1)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8892 entries, 0 to 8891
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    8892 non-null   int64
 1   month   8892 non-null   object
 2   state   8892 non-null   object
 3   gender  8892 non-null   object
 4   value   8892 non-null   int64
 5   unit    8892 non-null   object
dtypes: int64(2), object(4)
memory usage: 416.9+ KB

In [7]:
df.to_csv('population.csv')